Project/Toir.Adaptation/src/Documents/торо_ПланГрафикРемонта/торо_ПланГрафикРемонта.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>торо_ПланГрафикРемонта</name>
  <objectBelonging>Adopted</objectBelonging>
  <tabularSections>
    <name>ПланРемонтов</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>ВидРемонтныхРабот</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ДатаНач</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <dateQualifiers>
            <dateFractions>Date</dateFractions>
          </dateQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>ДатаКон</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <dateQualifiers>
            <dateFractions>Date</dateFractions>
          </dateQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>Отменен</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ОбъектРемонтныхРабот</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ID</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>36</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>Замещен</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Document>

Project/Toir.Adaptation/src/InformationRegisters/торо_РасположениеОРВСтруктуреИерархии/торо_РасположениеОРВСтруктуреИерархии.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="774db338-91f2-4ead-8895-fd51f145458a">
  <name>торо_РасположениеОРВСтруктуреИерархии</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources extendedConfigurationObject="d8481881-51b9-4962-8b6c-bfa78e30e457">
    <name>РодительИерархии</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="2c99b177-de41-496b-bfc8-0cd1b039671a">
    <name>Удален</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <dimensions extendedConfigurationObject="280e0fd3-b182-49f3-abd2-2c4247cfe274">
    <name>ОбъектИерархии</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="6bc5297f-c3fd-4ba2-ad6f-c69875395c47">
    <name>СтруктураИерархии</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir.Adaptation/src/InformationRegisters/торо_ИерархическиеСтруктурыОР/торо_ИерархическиеСтруктурыОР.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>торо_ИерархическиеСтруктурыОР</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <resources extendedConfigurationObject="ecf4614a-f3c8-44c8-9355-8a406a840ca5">
    <name>РодительИерархии</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <dimensions extendedConfigurationObject="c4d866bf-46bc-412c-b7cf-a88074622812">
    <name>ОбъектИерархии</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="7f327261-9505-4dcb-bf45-cd6eb8ce0242">
    <name>СтруктураИерархии</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir.Adaptation/src/Enums/Периодичность/Периодичность.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>Периодичность</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="473b2fa8-99d9-4792-a6b8-e458d7079650">
    <name>День</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="75346382-d059-4b8c-b2b7-a18ca56176f2">
    <name>Неделя</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="2360f632-dc4d-4464-8c3c-855804dc7e36">
    <name>Полугодие</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="a367ecfc-7135-485a-9f99-bc5553ddb898">
    <name>Месяц</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="2712affc-b7ac-44a4-8973-8b9e94a64b14">
    <name>Год</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="f1050b47-3d75-4dc7-a340-fc03a54222fa">
    <name>Квартал</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

Project/Toir.Adaptation/src/Documents/торо_ПланГрафикРемонта/ManagerModule.bsl
// гкс+ [] Деснол 16.08.2022
&ИзменениеИКонтроль("ПечатьПланГрафикППР")
Функция гкс_ПечатьПланГрафикППР(МассивОбъектов, ПараметрыПечати)

	ТаблицаПлана = Новый ТабличныйДокумент;		
	МакетТаблицы =  УправлениеПечатью.МакетПечатнойФормы("Документ.торо_ПланГрафикРемонта.ПФ_MXL_МакетПланаРемонтовНаПериод");

	ЭтоПервый = Истина;
	#Вставка
	ТекИерархия = Константы.торо_ИерархияДляВводаНовыхОР.Получить();
	Если ТекИерархия.ИзменяетсяДокументами Тогда 
		ИмяРегистра = "РегистрСведений.торо_РасположениеОРВСтруктуреИерархии.СрезПоследних()";
	Иначе
		ИмяРегистра = "РегистрСведений.торо_ИерархическиеСтруктурыОР";
	КонецЕсли;
	#КонецВставки

	Для каждого ПланГрафикРемонта из МассивОбъектов Цикл

		Если НЕ ЭтоПервый Тогда
			ТаблицаПлана.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		ЭтоПервый = Ложь;

		Если ПараметрыПечати.Свойство("Параметры") Тогда
			СтруктураПараметровПечати = ПараметрыПечати.Параметры;
		Иначе
			СтруктураПараметровПечати = торо_ПечатьСервер.СтруктураПараметровППР(ПланГрафикРемонта);
		КонецЕсли;

		ПериодКон=СтруктураПараметровПечати.ДатаКонца;
		ПериодНач=СтруктураПараметровПечати.ДатаНачала;
		ИнтервалРазбиенияПереданный=СтруктураПараметровПечати.ИнтервалРазбиения;
		ОтборПечатнойФормы=СтруктураПараметровПечати.ОтборФормы;	

		ОтборПечатнойФормы[0].Имя="ОбъектРемонтныхРабот";
		ОтборПечатнойФормы[1].Имя="ВидРемонтныхРабот";

		Если ИнтервалРазбиенияПереданный = "Год" тогда 
			ИнтервалРазбиения=Перечисления.Периодичность.Год;
		ИначеЕсли ИнтервалРазбиенияПереданный = "Месяц" тогда 
			ИнтервалРазбиения=Перечисления.Периодичность.Месяц;
		ИначеЕсли ИнтервалРазбиенияПереданный = "Неделя" тогда 
			ИнтервалРазбиения=Перечисления.Периодичность.Неделя;
		ИначеЕсли ИнтервалРазбиенияПереданный = "День" тогда 
			ИнтервалРазбиения=Перечисления.Периодичность.День;
		КонецЕсли;	


		Если (ПланГрафикРемонта = Неопределено) Тогда
			ТекстСообщения = НСтр("es='"".';ru='Не выбран документ ""План-график ремонтов"".';en='The document ""Repair schedule"" has not been selected.'");
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		Иначе

			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	торо_ПланГрафикРемонтаОбъектыРемонта.ОбъектРемонтныхРабот,
			|	МИНИМУМ(торо_ПланГрафикРемонтаОбъектыРемонта.НомерСтроки) КАК НомерСтроки
			#Вставка
			|	,ВсяИерархия.РодительИерархии КАК Родитель
			#КонецВставки
			|ПОМЕСТИТЬ ОбъектыРемонта
			|ИЗ
			|	Документ.торо_ПланГрафикРемонта.ОбъектыРемонта КАК торо_ПланГрафикРемонтаОбъектыРемонта
			#Вставка
			|	Левое соединение " + ИмяРегистра + " КАК ВсяИерархия
			|	ПО ВсяИерархия.ОбъектИерархии = торо_ПланГрафикРемонтаОбъектыРемонта.ОбъектРемонтныхРабот
			#КонецВставки
			|ГДЕ
			|	торо_ПланГрафикРемонтаОбъектыРемонта.Ссылка = &Ссылка
			|
			|СГРУППИРОВАТЬ ПО
			|	торо_ПланГрафикРемонтаОбъектыРемонта.ОбъектРемонтныхРабот
			#Вставка
			|	,ВсяИерархия.РодительИерархии
			#КонецВставки
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	торо_ПланГрафикРемонтаПланРемонтов.Ссылка,
			|	торо_ПланГрафикРемонтаПланРемонтов.НомерСтроки,
			|	торо_ПланГрафикРемонтаПланРемонтов.ID,
			|	торо_ПланГрафикРемонтаПланРемонтов.ВидРемонтныхРабот,
			|	торо_ПланГрафикРемонтаПланРемонтов.ДатаКон,
			|	торо_ПланГрафикРемонтаПланРемонтов.ДатаНач,
			|	торо_ПланГрафикРемонтаПланРемонтов.Исполнитель,
			|	торо_ПланГрафикРемонтаПланРемонтов.ОбъектРемонтныхРабот,
			#Вставка
			|	торо_ПланГрафикРемонтаОбъектыРемонта.Родитель,
			#КонецВставки
			|	торо_ПланГрафикРемонтаПланРемонтов.СпособВыполнения,
			|	торо_ПланГрафикРемонтаПланРемонтов.Отменен,
			|	торо_ПланГрафикРемонтаПланРемонтов.Склад,
			|	торо_ПланГрафикРемонтаПланРемонтов.Замещен,
			|	торо_ПланГрафикРемонтаПланРемонтов.ID_базы_расчета,
			|	торо_ПланГрафикРемонтаПланРемонтов.ID_замещающего,
			|	торо_ПланГрафикРемонтаПланРемонтов.ДатаНачСт,
			|	торо_ПланГрафикРемонтаПланРемонтов.ДатаКонСт,
			|	торо_ПланГрафикРемонтаПланРемонтов.ЗамещенСт,
			|	торо_ПланГрафикРемонтаПланРемонтов.СуммаРемонта,
			|	торо_ПланГрафикРемонтаОбъектыРемонта.НомерСтроки КАК НомерОР
			|ИЗ
			|	Документ.торо_ПланГрафикРемонта.ПланРемонтов КАК торо_ПланГрафикРемонтаПланРемонтов
			|		ЛЕВОЕ СОЕДИНЕНИЕ ОбъектыРемонта КАК торо_ПланГрафикРемонтаОбъектыРемонта
			|		ПО торо_ПланГрафикРемонтаПланРемонтов.ОбъектРемонтныхРабот = торо_ПланГрафикРемонтаОбъектыРемонта.ОбъектРемонтныхРабот
			|ГДЕ
			|	торо_ПланГрафикРемонтаПланРемонтов.Ссылка = &Ссылка";

			Сч = 0;
			Для каждого СтрокаОтбора Из ОтборПечатнойФормы Цикл
				Если СтрокаОтбора.Использование Тогда
					Сч = Сч + 1;
					РеквизитОтбора = СтрокаОтбора.Имя;
					ВидСравненияВЗапросе = ПолучитьВидСравненияДляЗапроса(СтрокаОтбора.ВидСравнения);
					Если ЗначениеЗаполнено(СтрокаОтбора.Имя) Тогда

						Запрос.Текст = Запрос.Текст + " И торо_ПланГрафикРемонтаПланРемонтов." + СтрокаОтбора.Имя + " " + ВидСравненияВЗапросе.ВидСравненияНачало + " &Параметр" + Сч + ВидСравненияВЗапросе.ВидСравненияКонец;	
						Если СтрокаОтбора.ВидСравнения = ВидСравнения.Содержит ИЛИ СтрокаОтбора.ВидСравнения = ВидСравнения.НеСодержит Тогда
							Запрос.УстановитьПараметр("Параметр"+ Сч, "%" + СтрокаОтбора.Значение + "%");
						Иначе
							Запрос.УстановитьПараметр("Параметр"+ Сч, СтрокаОтбора.Значение);
						КонецЕсли;

					КонецЕсли;
				КонецЕсли;

			КонецЦикла;

			Запрос.Текст = Запрос.Текст + 
			" И торо_ПланГрафикРемонтаПланРемонтов.Отменен = ЛОЖЬ 
			| И торо_ПланГрафикРемонтаПланРемонтов.Замещен = ЛОЖЬ
			|УПОРЯДОЧИТЬ ПО
			|	НомерОР";

			Запрос.УстановитьПараметр("Ссылка", ПланГрафикРемонта);
			ПланРемонтов = Запрос.Выполнить().Выгрузить();

			Наименование = "";

			Область = МакетТаблицы.ПолучитьОбласть("Заголовок");	
			Область.Параметры.НачалоПериода = Формат(ПериодНач, "ДФ = ""дд.ММ.гггг""; ДП = ""без ограничения""");
			Область.Параметры.КонецПериода = Формат(ПериодКон, "ДФ = ""дд.ММ.гггг""; ДП = ""без ограничения""");
			Область.Параметры.Организация = ПланГрафикРемонта.Организация;
			Область.Параметры.Подразделение = ПланГрафикРемонта.Подразделение;
			Область.Параметры.Номер = ПланГрафикРемонта.Номер;
			Область.Параметры.Название = Наименование;
			Если ПланГрафикРемонта.ВидОперации = Перечисления.торо_ВидыОперацийПланаГрафикаППР.Корректировка Тогда                                               			
				Область.Параметры.Корректировка =  СтрШаблон(НСтр("es='La corrección del documento %1';ru='корректировка документа %1';en='document adjustment %1'"), ПланГрафикРемонта.ДокументОснование);			
			КонецЕсли;

			ТаблицаПлана.Вывести(Область);

			ПериодовВОтчете = (НачалоДня(ПериодКон) - НачалоДня(ПериодНач))/(60*60*24);

			Область = МакетТаблицы.ПолучитьОбласть("Шапка");

			ШиринаТаблицы = Область.ШиринаТаблицы;

			ТаблицаПлана.Вывести(Область);

			ТемпДата = НачалоДня(ПериодНач);

			ПериодНачРасчетный = ПериодНач;
			ПериодКонРасчетный = ПериодКон;

			МассивВременныхИнтервалов = Новый Массив;

			Если ИнтервалРазбиения = Перечисления.Периодичность.День Тогда
				ПериодКонРасчетный = КонецДня(ПериодКон);
				ПериодовВОтчете = 0;
				СледующийДень = Истина;
				Пока СледующийДень Цикл
					Область = МакетТаблицы.ПолучитьОбласть("СтолбецДня");
					ОбластьОформления = Область.Область("Знач");

					Область.Параметры.НомИнтервала = Формат(ТемпДата, "ДФ = ""дд.ММ.гггг""; ДП = ""без ограничения""");
					Если ДеньНедели(Дата(Год(ТемпДата), Месяц(ТемпДата), День(ТемпДата), 0,0,0))=6 или ДеньНедели(Дата(Год(ТемпДата), Месяц(ТемпДата), День(ТемпДата), 0,0,0))=7 Тогда
						ОбластьОформления.ЦветФона = новый Цвет(255,251,240);
						ОбластьОформления.ЦветТекста = новый Цвет(0,0,0);
					КонецЕсли;

					ЕдиничныйИнтервал = Новый Структура;
					ЕдиничныйИнтервал.Вставить("НачИнт",НачалоДня(ТемпДата));
					ЕдиничныйИнтервал.Вставить("КонИнт",КонецДня(ТемпДата));	
					МассивВременныхИнтервалов.Добавить(ЕдиничныйИнтервал);

					ТаблицаПлана.Присоединить(Область);
					ТемпДата = ТемпДата+60*60*24; 
					Если ТемпДата > ПериодКонРасчетный Тогда
						СледующийДень = Ложь;		
					КонецЕсли;
					ПериодовВОтчете = ПериодовВОтчете + 1;
				КонецЦикла;
				ШиринаТаблицы = ШиринаТаблицы + ПериодовВОтчете*Область.ШиринаТаблицы;
			ИначеЕсли ИнтервалРазбиения = Перечисления.Периодичность.Неделя Тогда 
				ПериодКонРасчетный = КонецНедели(ПериодКон);
				ТемпДата = НачалоДня(НачалоНедели(ПериодНач));
				ПериодовВОтчете = 0;	
				СледующаяНеделя = Истина;
				Пока СледующаяНеделя Цикл 
					Область = МакетТаблицы.ПолучитьОбласть("СтолбецДня");
					ОбластьОформления = Область.Область("Знач");

					Область.Параметры.НомИнтервала = Формат(ТемпДата, "ДФ = ""дд.ММ.гггг""; ДП = ""без ограничения""") + "-" + Формат(ТемпДата+60*60*24*6, "ДФ = ""дд.ММ.гггг""; ДП = ""без ограничения""");
					ТаблицаПлана.Присоединить(Область);

					ЕдиничныйИнтервал = Новый Структура;
					ЕдиничныйИнтервал.Вставить("НачИнт",НачалоНедели(ТемпДата));
					ЕдиничныйИнтервал.Вставить("КонИнт",КонецНедели(ТемпДата));	
					МассивВременныхИнтервалов.Добавить(ЕдиничныйИнтервал);

					ТемпДата = ТемпДата+60*60*24*7;
					Если НачалоДня(ТемпДата) > НачалоДня(ПериодКонРасчетный) Тогда
						СледующаяНеделя = Ложь;		
					КонецЕсли;	
					ПериодовВОтчете = ПериодовВОтчете + 1;
				КонецЦикла;
				ШиринаТаблицы = ШиринаТаблицы + ПериодовВОтчете*Область.ШиринаТаблицы;
			ИначеЕсли ИнтервалРазбиения = Перечисления.Периодичность.Месяц Тогда 
				ПериодКонРасчетный = КонецМесяца(ПериодКон);
				ТемпДата = НачалоМесяца(ПериодНач);
				ПериодовВОтчете = 0;
				СледующийМесяц = Истина;
				Пока СледующийМесяц Цикл
					Область = МакетТаблицы.ПолучитьОбласть("СтолбецДня");
					ОбластьОформления = Область.Область("Знач");

					// >> [Деснол] [Ушаков А.Д.] [26.09.2019] 
					Область.Параметры.НомИнтервала = НазваниеМесяцаСтрокой_ИменительныйПадеж(ТемпДата) + Символы.ПС + Сред(ТемпДата,7,4); 
					//Область.Параметры.НомИнтервала = НазваниеМесяцаСтрокойПадежное(Месяц(ТемпДата)) + Символы.ПС + Сред(ТемпДата,7,4); 
					// << [Деснол] [Ушаков А.Д.] [26.09.2019] 
					ТаблицаПлана.Присоединить(Область);

					ЕдиничныйИнтервал = Новый Структура;
					ЕдиничныйИнтервал.Вставить("НачИнт",НачалоМесяца(ТемпДата));
					ЕдиничныйИнтервал.Вставить("КонИнт",КонецМесяца(ТемпДата));	
					МассивВременныхИнтервалов.Добавить(ЕдиничныйИнтервал);

					ТемпДата = ДобавитьМесяц(ТемпДата,1);
					Если ТемпДата > ПериодКонРасчетный Тогда
						СледующийМесяц = Ложь;		
					КонецЕсли;	
					ПериодовВОтчете = ПериодовВОтчете + 1;
				КонецЦикла;
				ШиринаТаблицы = ШиринаТаблицы + ПериодовВОтчете*Область.ШиринаТаблицы;
			ИначеЕсли ИнтервалРазбиения = Перечисления.Периодичность.Год Тогда 
				ПериодКонРасчетный = КонецГода(ПериодКон);
				ТемпДата = НачалоГода(ПериодНач);
				ПериодовВОтчете = 0;
				СледующийГод = Истина;
				Пока СледующийГод Цикл
					Область = МакетТаблицы.ПолучитьОбласть("СтолбецДня");
					ОбластьОформления = Область.Область("Знач");

					Область.Параметры.НомИнтервала = Сред(ТемпДата,7,4); 
					ТаблицаПлана.Присоединить(Область);

					ЕдиничныйИнтервал = Новый Структура;
					ЕдиничныйИнтервал.Вставить("НачИнт",НачалоГода(ТемпДата));
					ЕдиничныйИнтервал.Вставить("КонИнт",КонецГода(ТемпДата));	
					МассивВременныхИнтервалов.Добавить(ЕдиничныйИнтервал);

					ТемпДата = ДобавитьМесяц(ТемпДата,12);
					Если ТемпДата > ПериодКонРасчетный Тогда
						СледующийГод = Ложь;		
					КонецЕсли;	
					ПериодовВОтчете = ПериодовВОтчете + 1;
				КонецЦикла; 
				ШиринаТаблицы = ШиринаТаблицы + ПериодовВОтчете*Область.ШиринаТаблицы;
			КонецЕсли;


			Область = МакетТаблицы.ПолучитьОбласть("ПравыйКрайЗаглушка");
			ТаблицаПлана.Присоединить(Область);

			// Непосредственно вывод данных по объекту

			НСТР = 1;

			СписокХранения = Новый СписокЗначений;
			#Вставка
			СоответствиеРодителей = Новый Соответствие();
			#КонецВставки

			Для каждого СтрокаТаблицы из ПланРемонтов Цикл
				ОбъектДляДобавления =  СтрокаТаблицы.ОбъектРемонтныхРабот;
				#Вставка
				СоответствиеРодителей.Вставить(СтрокаТаблицы.ОбъектРемонтныхРабот, СтрокаТаблицы.Родитель);
				#КонецВставки

				Если СписокХранения.НайтиПоЗначению(ОбъектДляДобавления)=Неопределено Тогда
					СписокХранения.Добавить(ОбъектДляДобавления);			
				КонецЕсли;

			КонецЦикла;

			МассивОбъектов = СписокХранения.ВыгрузитьЗначения();
			КоличествоОбъектов = МассивОбъектов.Количество();	
			Для каждого ОбъектДляОтчета из МассивОбъектов Цикл
				Область = МакетТаблицы.ПолучитьОбласть("СтрокаЗаполнения");
				ФорматнаяОбласть = Область.Область("НаимПрим");
				ФорматнаяОбласть.Примечание.Текст = ОбъектДляОтчета.ПлановыйГрафикРаботы.Наименование;

				Область.Параметры.НПП = НСТР;
				#Удаление
				Область.Параметры.НаименовОбъекта = торо_ЗаполнениеДокументов.ПолучитьПредоставленияОРДляПечати(ОбъектДляОтчета);
				#КонецУдаления
				#Вставка
				Родитель = СоответствиеРодителей.Получить(ОбъектДляОтчета);
				Если ЗначениеЗаполнено(Родитель) Тогда 
					Область.Параметры.НаименовОбъекта = Строка(Родитель) + " \ " 
					+ торо_ЗаполнениеДокументов.ПолучитьПредоставленияОРДляПечати(ОбъектДляОтчета);
				Иначе
					Область.Параметры.НаименовОбъекта = торо_ЗаполнениеДокументов.ПолучитьПредоставленияОРДляПечати(ОбъектДляОтчета);
				КонецЕсли;
				#КонецВставки
				Область.Параметры.ТехнологическийН = ОбъектДляОтчета.ТехНомер;
				Область.Параметры.ЗаводскойН = ОбъектДляОтчета.ЗаводскойНомер;
				Область.Параметры.ИнвентарныйН = ОбъектДляОтчета.ИнвентарныйНомер;

				Результ = ПоследнийРемонт(ОбъектДляОтчета,ПланГрафикРемонта.ДатаПланирования);

				ПредставлениеВидаРемонта = "ВВЭ";
				Если ТипЗнч(Результ[0].Объект) = Тип("СправочникСсылка.торо_ВидыРемонтов") Тогда
					ПредставлениеВидаРемонта = торо_ЗаполнениеДокументов.ПолучитьПредоставленияВРДляПечати(Результ[0].Объект);
				ИначеЕсли ЗначениеЗаполнено(Результ[0].Объект) Тогда
					ПредставлениеВидаРемонта = Результ[0].Объект;
				КонецЕсли;

				Область.Параметры.Вид = ПредставлениеВидаРемонта;
				ДатаДляФормата = Дата(Результ[0].Период);
				Область.Параметры.Дата = Формат( ДатаДляФормата, "ДФ = ""дд/ММ/гггг""");

				КолЧасов2=0;


				Область.Параметры.КолвоЧасов = КолЧасов2;

				ТаблицаПлана.Вывести(Область);	

				линСплошная = новый Линия(ТипЛинииЯчейкиТабличногоДокумента.Сплошная);
				линНикакая = новый Линия(ТипЛинииЯчейкиТабличногоДокумента.НетЛинии);

				Условие = Новый Структура;
				Условие.Вставить("ОбъектРемонтныхРабот", ОбъектДляОтчета);
				Условие.Вставить("Отменен", Ложь);
				НайденныеСтроки = ПланРемонтов.НайтиСтроки(Условие); 		
				для Сч = 1 по  МассивВременныхИнтервалов.Количество() Цикл

					БуфГод = "";
					ТекущийПериодНач = МассивВременныхИнтервалов[Сч-1].НачИнт;
					ТекущийПериодКон = МассивВременныхИнтервалов[Сч-1].КонИнт;

					Область = МакетТаблицы.ПолучитьОбласть("ЗначенияДня");
					ОбластьФормат =  Область.Область();

					Для Каждого ОбъектСравнения из НайденныеСтроки цикл 

						Если ОбъектСравнения.ДатаКон<ОбъектСравнения.ДатаНач Тогда
							КонечнаяДата = КонецДня(ОбъектСравнения.ДатаНач);	
						Иначе
							КонечнаяДата = ОбъектСравнения.ДатаКон;
						КонецЕсли; 

						Если  ((ТекущийПериодКон>=ОбъектСравнения.ДатаНач) и (ТекущийПериодНач<=КонечнаяДата)) или
							((ТекущийПериодКон>ОбъектСравнения.ДатаНач) и (ТекущийПериодНач<=КонечнаяДата)) Тогда
							ОбластьФормат.ЦветФона = новый Цвет(255, 251, 240);
							ОбластьФормат.ГраницаСлева =линНикакая;
							ОбластьФормат.ГраницаСправа = линСплошная;
							ПредставлениеВидаРемонта = торо_ЗаполнениеДокументов.ПолучитьПредоставленияВРДляПечати(ОбъектСравнения.ВидРемонтныхРабот);
							БуфГод = БуфГод + ПредставлениеВидаРемонта + ", ";

							Область.Параметры.заполнение = БуфГод;
							ОбластьФормат.Примечание.Текст =  ОбластьФормат.Примечание.Текст + ПредставлениеВидаРемонта 
							+ " (" + Лев(ОбъектСравнения.ДатаНач, 10) + " - " + Лев(ОбъектСравнения.ДатаКон, 10) + ") " + Символы.ПС
						КонецЕсли;	

					КонецЦикла;	

					ТаблицаПлана.Присоединить(Область);

				КонецЦикла;
				Область = МакетТаблицы.ПолучитьОбласть("ПравыйКрайЗаглушка2");
				ТаблицаПлана.Присоединить(Область);

				НСТР = НСТР + 1;

			КонецЦикла;

			ОбластьПодвал = МакетТаблицы.ПолучитьОбласть("Подвал");
			ОбластьПодвал.Область(1,1,1, ШиринаТаблицы).ГраницаСверху = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.Сплошная,2);
			ТаблицаПлана.Вывести(ОбластьПодвал);

			Область = МакетТаблицы.ПолучитьОбласть("Пояснение");	
			ТаблицаПлана.Вывести(Область);

		КонецЕсли;

		ТабДок = Новый ТабличныйДокумент;
		ТабДок.КлючПараметровПечати = "торо_ПечатьПланГрафика_МакетПланаРемонтовНаПериод";
		ТабДок.ИмяПараметровПечати = "торо_ПечатьПланГрафика_МакетПланаРемонтовНаПериод";
		ТабДок.ВставитьОбласть(ТаблицаПлана.Область());

	КонецЦикла;

	ТабДок.ТолькоПросмотр = Истина;
	Возврат ТабДок;

КонецФункции // гкс- [] Деснол 16.08.2022
